var npc = [
{
	id:0,
	type:0,
	desc:"这人看起来破破烂烂的",
	wp:0,
	name:"路人",
	step:1,
	o:{},	//玩家
	a:{},	//npc
	f:{},
	d:{},	//描述
},
];

npc[0].d["0"] = "毫无表情地看着你";
npc[0].o["0"] = [{w:"你好",t:1},{w:"打扰了",t:2}];

npc[0].d["1"] = "点头示意";
npc[0].a["1"] = ["你也好"];
npc[0].o["1"] = [{w:"请问，你知道恶龙在哪里吗",t:3},{w:"打扰了",t:2}];

npc[0].d["2"] = "挥了挥手";
npc[0].a["2"] = ["再见"];
npc[0].o["2"] = [{w:"",t:-1}];

npc[0].d["3"] = "担心的眼神";
npc[0].a["3"] = ["你要去找恶龙吗？这太危险了。让我想想...","听说恶龙在北边的幽暗城，你也许应该问问酒馆老板。"];
npc[0].o["3"] = [{w:"谢谢你，善良的人，我正是要去找恶龙。",t:4,i:"(关于恶龙，也许要去问问旅馆老板？)"}];

npc[0].d["4"] = "担心的眼神";
npc[0].a["4"] = ["不用谢，哎，你可要小心啊"];
npc[0].o["4"] = [{w:"我会的，再见。",t:2}];

export default { npc}; 